[

    {
      "title": "Challenges of Embedding Sustainability in Organizational Culture",
      "type": "Research Paper",
      "issue2": true,
      "link": "journal-files/1_Sustainability- Trivino_Jyro_Rev.pdf",
      "author": {
        "name": "",
        "name_raw": "",
        "info": ["Jyro B. Triviño, Teaching Faculty","Ateneo de Manila University, Philippines"]
      },
     
       "volume": "3",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/3-2II2023/1bmlm",
      "doidate": "October 2023",
      "abstract": "Advocating for robust, aggressive, and advanced sustainability is ideal yet challenging. It means not only decreasing additional harm to the environment but at the same time objectively using renewable energy flow. Embedding sustainability as part of organizational culture appears to be a daunting task. Not all enterprise managers have a comprehensive understanding of the phenomenon, which entails proper awareness of its benefits and consequences. This qualitative study is focused on the ability of Philippine business enterprises to embed a regenerative sustainable culture. It includes salient insights from five Philippine medium-sized enterprise owners, who were also acting as managers. It shows that the main operations of their business are mainly focused on survival through profitability and not sustainability, but that it is possible to integrate sustainability into their operations. This study also suggests a practical approach to embedding sustainability through strategic planning.",
      "keywords": [
        "Conventional sustainability",
        "contemporary sustainability",
        "regenerative sustainability",
        "organizational culture",
        "strategic planning",
        "Philippine enterprise"
      ]
    },
    {
      "title": "Silent disengagement: A case study on 'quiet quitting' among professors in Metro Manila's private higher education institutions amidst remote/hybrid work",
      "type": "Research Paper",
      "issue2": true,
      "link": "journal-files/2_Silent disengagement-Jessica_Rev.pdf",
      "author": {
        "name": "",
        "name_raw": "",
        "info": ["Albert Hong, Manuel Christopher Cortez, Tracey Garcia, Daniella Lorenzo, Jessica Jaye Ranieses De La Salle University, Philippines"]
      },
       "volume": "3",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/3-2II2023/2bmlm",
      "doidate": "October 2023",
      "abstract": "This study investigates the phenomenon of ‘quiet quitting’ among professors in private higher education institutions (HEIs) in Metro Manila. Quiet quitting is a subtle form of disengagement, often in response to dissatisfaction with their employer. Leveraging the basic psychological need theory (BPNT), this research explores the causes, factors, and potential solutions to this issue. This study aimed to explore the occurrence of quiet quitting among university professors during the transition to online education amid the pandemic. The researchers conducted a cross-case analysis of eight respondents, identifying three basic psychological needs – competence, autonomy, and relatedness – as instrumental in preventing or precipitating quiet quitting. The findings demonstrate that institutions able to fulfill these needs were successful in curbing quiet quitting. The study also found that while literature largely frames quiet quitting as a work-oriented phenomenon beneficial to employees, professors saw it as detrimental to their self-realization and sense of purpose. The study contradicts the prevailing perspective that quiet quitting is solely driven by work-life balance, instead emphasizing the importance of intrinsic motivators such as purpose, responsibility, and commitment to students, in addition to extrinsic motivators like salary. The paper concludes with recommendations for institutions to focus on employee well-being, workload management, and provision of support programmes to address quiet quitting. It also suggests the potential use of the self-determination theory for future research on quiet quitting. This study expands the understanding of quiet quitting in academia, offering actionable insights for institutional strategy and policy development.",
      "keywords": [
        "Quiet quitting",
        "higher education institutions",
        "remote work challenges",
        "job satisfaction strategies",
        "basic psychological need theory"
      ]
    },
    {
      "title": "The influence of transformational leadership on teacher motivation towards more inclusive education",
      "type": "Research Paper",
      "issue2": true,
      "link": "journal-files/3_Inclusive Education-Jaya-ahuja_Rev.pdf",
      "author": {
        "name": "",
        "name_raw": "",
        "info": ["Jaya Ahuja Associate Professor, BML Munjal University, India", "Mohit Yadav Associate Professor, O. P. Jindal Global University, India"]
      },
       "volume": "3",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/3-2II2023/3bmlm",
      "doidate": "October 2023",
      "abstract": "A major challenge faced by educational institutions is managing student diversity. Inclusive education is a human right and the central axis for achieving a fair and equitable society. There has been an increasing focus on inclusion in higher education. Employee motivation is one of the key requirements for promoting inclusivity in the workplace. A strong leadership can motivate employees and promote inclusion at workplace. This study aims to investigate the relationship between transformational leadership and student motivation in higher education. A survey was conducted among 289 academicians from private universities in the Delhi-NCR region. A mediation model was run to test the mediating effect of training towards inclusive education on transformational leadership and teacher motivation relationship. The findings support the hypothesized relationships, indicating the significant impact of transformational leadership on teacher motivation which is significantly mediated by training towards inclusive education.",
      "keywords": [
        "Inclusivity",
        "inclusive education",
        "transformational leadership",
        "student motivation",
        "teacher motivation",
        "training"
      ]
    },
    {
      "title": "Acceptance for e-learning through development programmes among faculty and students in India",
      "type": "Research Paper",
      "issue2": true,
      "link": "journal-files/4_e-learning-Ruchi-Garg_Rev.pdf",
      "author": {
        "name": "",
        "name_raw": "",
        "info": ["Ruchi Garg Associate Professor, BML Munjal University, India","Ritu Chhikara Associate Professor, BML Munjal University, India","Aakansha Kataria Assistant Professor, Malaviya National Institute of Technology, India","Rubal Rathi Research Scholar, BML Munjal University, India"]
      },
       "volume": "3",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/3-2II2023/4bmlm",
      "doidate": "October 2023",
      "abstract": "Higher education institutions had been delinquent in adopting e-learning platforms before COVID-19 hit. The sudden shift was both dark and bright for institutions depending upon their infrastructural capabilities, faculty and student acceptance, and intention to adopt e-learning platforms. As a part of capability building, many universities initiated online development programmes for faculty and students to ensure uninterrupted learning. This study examines the success of similar programmes run by a state university in India. The aim is to examine the improvement in the acceptance for e-learning among faculty and students and its impact on their self-efficacy and behavioural intention. The study analyzes the responses pre- and post-successful completion of a month-long faculty and student development programme. The results reveal that acceptance, self-efficacy, and behavioural intention increased after these programmes.",
      "keywords": ["E-learning",
       "experiment study",
       "higher education",
       "self-efficacy",
       "behavioural intention"]
    },
    {
      "title": "Institutional void to institutional work: Study of digital finance in India",
      "type": "Research Paper",
      "issue2": true,
      "link": "journal-files/5_Digital-Finance-India-Anirudh_Rev.pdf",
      "author": {
        "name": "",
        "name_raw": "",
        "info": ["Dr. Anirudh Agrawal Associate Professor, OP Jindal Global University, Delhi, India","Dr. Kristjan Johannes Suse Jespersen Associate Professor of Sustainable Innovation and Entrepreneurship Copenhagen Business School, Copenhagen, Denmark","Dr. Keerti Pendyal Assistant Professor, Mahindra University, Hyderabad, India"]
      },
       "volume": "3",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/3-2II2023/5bmlm",
      "doidate": "October 2023",
      "abstract": "This article presents a longitudinal view on the development of digital finance in India, tracing the growth of digital finance in India from the 1950s to 2022. It discusses various legislations, litigations and civil society activism towards the initialization of digital finance in India. Consequently, this article studies the institutional development of digital finance in India using an institutional work framework. Further, it draws on the institutional voids and institutional work framework to reflect on the present state of digital finance and the work required to ensure that it is more inclusive and protective of its users' property rights. The article’s main contributions are that it applies the concepts of institutional voids and institutional works to the case of the institutionalization of digital finance in India and studies the development of digital finance in India using expert interviews and secondary data analysis.",
      "keywords": [
        "Digital finance",
        "India",
        "institutional work framework",
        "institutional voids"
      ]
    },
    {
      "title": "Young men (in crisis) and the search for a healthy masculine identity: How might managers respond? Interviewer Payal Kumar p.92-101",
      "type": "Interview",
      "issue2": true,
      "link": "journal-files/6_Interview-masculinity-Harris_Rev.pdf",
      "author": {
        "name": "",
        "name_raw": "",
        "info": []
      },
       "volume": "",
      "issue": "",
      "doiurl": "",
      "doidate": "",
      "abstract": null,
      "keywords": null
    },
    {
        "title": "Guru to the World: The Life and Legacy of Vivekananda",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/7_Book-review-Vivekananda-Dutt_Rev.pdf",
        "author": {
          "name": "",
          "name_raw": "",
          "info": ["Sreejit Datta, Assistant Professor, UID, Karnavati University, Gujarat India p.102-110"]
        },
         "volume": "",
      "issue": "",
      "doiurl": "",
      "doidate": "",
        "abstract": null,
        "keywords": null
      },
      {
        "title": "The Human Element: Overcoming the Resistance That Awaits New Ideas",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/8_Book Review-Mull-The Human Element 8.1.2023_Rev.pdf",
        "author": {
          "name": "",
          "name_raw": "",
          "info": ["Mandolen Mull, Ph.D., MullMentum Consulting, LLC p.111-117"]
        },
         "volume": "",
      "issue": "",
      "doiurl": "",
      "doidate": "",
        "abstract": null,
        "keywords": null
      }
  ]
  