[
  {
    "title": "Taking Business Ethics Seriously- Why Ethics Is an Essential Tool for the Modern Workplace by John Hooker, Productivity Press",
    "type": "Book Review",
    "issue2": true,
    "link": "journal-files/Book Review-Taking Ethics Seriously.pdf",
    "author": {
      "name": "",
      "name_raw": "",
      "info": [""]
    },
    "abstract": "Dr Elva A Resendez, Clinical Assistant Professor in Management, Doermer School of Business at Purdue University Fort Wayne Indiana &amp; Danny House, Quality Engineer, senior member of the American Society for Quality (ASQ)",
    "keywords": [""]
  },
  {
    "title": "The Art of Meaningful Universal Values: Case Study Analysis",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Universal Values-May.pdf",
    "author": {
      "name": "May Tungtakanpoung & Maria Postoyeva",
      "name_raw": "May Tungtakanpoung & Maria Postoyeva",
      "info": [
        "London South Bank Business School, England",
        "Westminster Business School, England"
      ]
    },
    "abstract": "This article explores the relationship between individual and organizational values in order to create a positive performance outcome. Meaningful organizational cultures based on intrinsic values have been found to increase staff engagement and create a happy workforce, which in turn leads to improved customer service and loyalty. Yet, organizations struggle to develop such cultures. The study of organizational and individual values in the airline industry is particularly under-theorised and under investigated. So, the case studies of Thai Airways and South West Airlines were used to illustrate how organizational culture can be enhanced by recognising and incorporating real and intrinsic values. This paper contributes to knowledge as it shows how a more meaningful culture can be developed by incorporating individuals’ spiritual beliefs into organizational values. It further contributes by exploring how such meaningful organizational cultures can make organizations more resilient and adaptable in unpredictable and demanding environments.",
    "keywords": [
      "organizational culture, strategy, values, universal value-based model, work environment."
    ]
  },
  {
    "title": "Faculty development initiatives critical to navigate multicultural Business Schools",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Faculty Development-Sivakumar-pk.pdf",
    "author": {
      "name": "Soumya Sivakumar & Carly Speranza",
      "name_raw": "Soumya Sivakumar & Carly Speranza",
      "info": ["Marymount University, USA (ssivakum@marymount.edu)", "Marymount University, USA"]
    },
    "abstract": "Due to the increasing complexity of higher educational institutions and the rising mobility of students from new nations and cultures entering higher education, business school environments and their faculty are experiencing greater challenges in providing an inclusive learning experience across multiple classrooms and instructional formats. Business schools need to rise to the occasion to develop their faculty to meet these new challenges, rather than the onus being on faculty alone. This paper reviews the literature and ends with recommendations for business school administrators and management to help foster a business school culture of diversity, inclusion, and acceptance for faculty, staff, and students.",
    "keywords": [
      "Internationalization, ethical responsibility, business school, faculty development, AACSB, inclusive"
    ]
  },
  {
    "title": "Analyzing The Intention-Behaviour Gap on the use of Recycling Delivery Packaging",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Recycling-Ang.pdf",
    "author": {
      "name": "Stephanie Dianne Ang, Jenevieve Kimberly Chua, Franz Jerico Espineli, Kairin Nicole Yu & Patrick Adriel H Aure",
      "name_raw": "Stephanie Dianne Ang, Jenevieve Kimberly Chua, Franz Jerico Espineli, Kairin Nicole Yu & Patrick Adriel H Aure",
      "info": ["De La Salle University, Philippines"]
    },
    "abstract": "Drawing on the Theory of Planned Behaviour (TPB) and the Norm Activation Model (NAM), this study examines the gap between consumer intention and behaviour, in the context of product delivery packaging recyclability, through the factors that affect it. Using a mixed-method, sequential- explanatory approach, survey data was analyzed through Jamovi, while insights from the interviews were derived via thematic analysis. This study found that awareness of consequences is a factor that affects personal norms. Additionally, personal norms mediate the relationship between awareness of consequences and recycling intention. Furthermore, perceived behavioural control significantly affects how intention influences behaviour. This research can contribute to creating evidence-based recycling initiatives and solutions for the government and e-commerce to stimulate consumer recycling behaviour and alleviate the environmental impact of post-product delivery packaging waste.",
    "keywords": [
      "Theory of Planned Behaviour, Norm Activation Model, recycling intention, recycling behaviour, product delivery packaging"
    ]
  },
  {
    "title": "Organizational Resilience of Filipino Music Performers during the COVID-19 Pandemic: A Dynamic Capabilities View",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Music-Jimenez-PB.pdf",
    "author": {
      "name": "Maria Monica Therese Hernaez, Joshua Martin Magallanes, Hans Erickson Tan, Shieradel V. Jimenez & Emmanuel Fernando Jimenez",
      "name_raw": "Maria Monica Therese Hernaez, Joshua Martin Magallanes, Hans Erickson Tan, Shieradel V. Jimenez & Emmanuel Fernando Jimenez",
      "info": ["De La Salle University, Philippines"]
    },
    "abstract": "This study looks into the dynamic capabilities theory and its relationship with organizational resilience by drawing on a sample of select Filipino live music performers, specifically rock bands. A qualitative thematic analysis approach was used to answer the research questions with the help of transcribed interviews and online data. The pandemic gave rise to several obstacles. To overcome these challenges, the bands exhibited dynamic capabilities. Key themes in each of the capacities of the dynamic capabilities framework were seen, for example, Digital Transformation and Vicarious Learning under Sense, and Changing the Songwriting Process and Evolving Future Outlook under Transform. This study can help business organizations, artists, and workers in the live music industry cope with fast-changing environments and crises. This research can also serve to understand dynamic capabilities in more detail.",
    "keywords": [
      "Philippines, live music performers, dynamic capabilities, organizational resilience"
    ]
  },
  {
    "title": "Understanding the Concept of Doubled Suffering in Capitalist-Oriented Organizations",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Suffering-Angela Chen-Final.pdf",
    "author": {
      "name": "Angela P. Chen, Australia (angela.chen@unimelb.edu.au)",
      "name_raw": "Angela P. Chen, Australia (angela.chen@unimelb.edu.au)",
      "info": ["University of Melbourne"]
    },
    "abstract": "In compassion literature, suffering is typically described as an undeniable reality in organizational life. While compassion literature has described the assessing sub-process as informing whether an individual will respond compassionately or not, there are fewer insights regarding the relationship between a non-response and suffering. This study seeks to understand the suffering experience from the employee’s perspective by interviewing 26 managers and non-managers from various industries. The results indicate that when individuals perceive their suffering as being ignored, this exacerbates their suffering. The preliminary finding suggests that continuing business-as-usual and doing nothing in the face of an employee’s suffering can “double” their suffering.",
    "keywords": [
      "compassion, organizations, leaders, doubled suffering, capitalism"
    ]
  },
  {
    "title": " Putting people and planet ahead of profits: Nudges in Investor Profile Questionnaires",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Bruno-sustainability-nudge.pdf",
    "author": {
      "name": "Bruno Dyck, Chi Liao & Rajesh V. Manchanda",
      "name_raw": "Bruno Dyck, Chi Liao & Rajesh V. Manchanda",
      "info": ["University of Manitoba", "Winnipeg, MB R3T 5V4. Canada"]
    },
    "abstract": "In light of the increasing concern about social and ecological crises facing humankind, this experimental study uses nudge theory to examine whether Investor Profile Questionnaires can be redesigned so that retail investors are nudged towards investments that place social and ecological returns ahead of financial returns, and away from investments that (merely) seek to maximize financial returns. Contrary to our predictions, our findings indicate that adding sustainability-oriented awareness and attitudinal nudges to Investor Profile Questionnaires did not result in participants decreasing the proportion of funds they invested in business-as-usual firms that focus primarily on maximizing financial returns. However, as predicted, the awareness and attitudinal nudges did increase the proportion of funds invested in firms that compromise financial returns in order to optimize social and ecological well-being. Moreover, investors’ attitudes towards sustainable investing were more positive after they received an action nudge versus (merely) an awareness nudge. Implications are discussed.",
    "keywords": [
      "Corporate Social Responsibility",
      "homo economicus",
      "Investor Profile Questionnaires",
      "nudge theory",
      "Socially Responsible Investing",
      "Sustainable Impact Investing"
    ]
  },
  {
    "title": "The role of ambassadors, influencers, and a brand in co-developing gendered well-being: The case of selected Dove Philippines campaign",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Dove-Espinada.pdf",
    "author": {
      "name": "Ivanna Chantal A. Espenida, Harriet Sheen B. Gallentes, Cyrielle A. Ontiveros, Rina Rose G. Tugade & Patrick Adriel H. Aure (patrick.aure@dlsu.edu.ph)",
      "name_raw": "Ivanna Chantal A. Espenida, Harriet Sheen B. Gallentes, Cyrielle A. Ontiveros, Rina Rose G. Tugade & Patrick Adriel H. Aure (patrick.aure@dlsu.edu.ph)",
      "info": ["De La Salle University, Phillipines"]
    },
    "abstract": "With the changing trends in business, it is essential to understand how different actors involved in a campaign enable a brand’s objective. This study aims to understand how internal stakeholders of advocacy campaigns can lead to a positive outcome in terms of external stakeholders’ social well-being, particularly in advocating gender well-being. This study utilized qualitative data collection methods to gather perspectives from both internal and external stakeholders to understand how the roles and responsibilities of internal stakeholders collectively help initiate brand advocacy campaigns. In this study, collaborative networks, partner selection, and research and development were assessed with respect to the co-development business model that leads to positive gendered well-being. It was found that there is an existing tension between the normative aspects of beauty and the internal perceptions of consumers. However, respondents shared that the advocacy campaigns facilitated by both influencers and ambassadors as part of the Dove Philippines projects launched in 2020 and 2021 were effective, since they enhanced their self-acceptance, self-esteem, and self-empowerment. The findings from the study can be used as a foundation for future research regarding influencer and ambassador marketing in the Philippines. In addition, it provides a practical application of the co-development business model not only to achieve mainstream business and marketing goals, but more importantly, advancing well-being.",
    "keywords": [
      "Influencers",
      "brand ambassadors",
      "co-development",
      "social well-being",
      "gendered well-being"
    ]
  },
  {
    "title": "Resilience and Hospitality in a Pandemic: A Polar-Type Study on Hotels in the Discovery Hospitality Group in the Philippines",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Hospitality-Belila.pdf",
    "author": {
      "name": "Ysabel Y. Balila, Ma. Alexandra Luisa N. Galvez, Maria Katrina E. Santos, Aedriel Philipson S. Secosana,Shieradel V. Jimenez, Angelique C. Blasa-Cheng",
      "name_raw": "Ysabel Y. Balila, Ma. Alexandra Luisa N. Galvez, Maria Katrina E. Santos, Aedriel Philipson S. Secosana,Shieradel V. Jimenez, Angelique C. Blasa-Cheng",
      "info": ["De La Salle University, University of the East"]
    },
    "abstract": "This study compares the best and worst-performing hotels from Discovery Hospitality Corporation (DHC), a Philippine hotel group, based on their crisis responses during the COVID-19 pandemic. This study employs a polar-type multiple case study research design using qualitative data gathered through semi-structured, in-depth interviews with semi-closed questions. The data was analyzed to assess the viability of key indicators that compose organizational resilience. Proactive consideration of external conditions is imperative for a hotel to be resilient and to survive in a pandemic. The external conditions that were found to be important in this study are: (1) location of the hotel, (2) population in the geographical location, (3) access points, and (4) government regulations. The authors propose that organizational resilience in the pandemic context relies on the following insights: (1) the interdependence of adaptive capacity, planning, and proactive consideration of external conditions; (2) clarity and discipline in serving a concrete target market; and (3) partnerships across private and public sectors. The research findings and key outcomes are interpreted as theoretical insights in the context of the operating environment of the case. This study also suggests that moral actions do not necessarily go against the need to manage internal resources efficiently – both can lead to resilience.",
    "keywords": [
      "organizational resilience",
      "hotel resilience",
      "adaptive capacity",
      "planning",
      "Philippine hospitality industry",
      "polar-type case study"
    ]
  },
  {
    "title": "Ethical dilemmas of a hospital managers in Indian corporate hospital –",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Paper-hospital manager-Singh.pdf",
    "author": {
      "name": "Abhishek Singh & Kasturi Shukla",
      "name_raw": "Abhishek Singh & Kasturi Shukla",
      "info": ["India"]
    },
    "abstract": "",
    "keywords": ["Ethical decision making, hospitals, quality assurance, WHO"]
  },
  {
    "title": "Workplace friendships and entrepreneurial intent: The mediating role of innovative behavior",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Workplace-friendship-Morales.pdf",
    "author": {
      "name": "Retchell Rubin L. Morales",
      "name_raw": "Retchell Rubin L. Morales",
      "info": ["De La Salle University, Phillipines"]
    },
    "abstract": "Workplace friendships (WPF) are informal and voluntary relationships, different from hierarchical relationships where there is a leader-and-subordinate association. Literature suggests that workplace friendship-type relationships influence innovative behaviour (IBE), yet there are varying results on its impact on entrepreneurial intention (EIN). Accordingly, this research builds on existing studies on these variables, exploring the mediating effect of innovative behaviour on workplace friendship and entrepreneurial intention. The investigation employed a quantitative, descriptive, causal, cross-sectional survey among 278 Philippine-based MSMEs. The results reveal that workplace friendships influence both innovative behaviour and entrepreneurial intention, and as shown in the model, innovative behaviour fully mediates workplace friendships and entrepreneurial intention. The study also illustrates that internal camaraderie, support and trust promote creativity and encourage innovation",
    "keywords": [
      "workplace friendship",
      "innovative behaviour",
      "entrepreneurial intention",
      "individual-opportunity nexus",
      "intrapreneurship",
      "corporate entrepreneurship"
    ]
  },
  {
    "title": "Chris Brewster: How does, or can, human resource management contribute to business, ethics and society?",
    "type": "Practioner Perspective",
    "issue2": true,
    "link": "journal-files/Interview-HRM-Chris Brewster.pdf",
    "author": {
      "name": "Dr Chris Brewster",
      "name_raw": "Dr Chris Brewster",
      "info": ["Interviewer: Khayar Al Ansi, Henley Business School, UK"]
    },
    "abstract": "Dr Chris Brewster is Professor of International Human Resource Management at Henley Business School in the UK. He is a prolific and highly cited author, with over 30 books, and 250 research articles. He was a practitioner for the first half of his working life and has been a scholar studying international and comparative human resource management for the second half. On the basis of that experience, he has increasingly argued for a more ethical, less elitist and more encompassing approach to human resource management. He recognizes that the economy is changing continuously with technological developments and argues that, although there are no easy answers, our thinking needs to encompass the long-term effects of technological change on human work."
  },
  {
    "title": "Clark, Cynthia E. Giving voice to values in the boardroom. Routledge, 2020. $31.50 Paperback ",
    "type": "Book Review",
    "link": "journal-files/Book-reivew-GVV-Boardroom-Mishra.pdf",
    "issue2": true,
    "author": {
      "name": "Reviewed Dr. Paresh Mishra",
      "name_raw": "Reviewed Dr. Paresh Mishra",
      "info": [
        "Associate Professor of Organizational Leadership at Purdue University Fort Wayne, USA"
      ]
    },
    "abstract": "The book Giving Voice to Values in the Boardroom by Cynthia E. Clark (2020) provides readers with insights and strategies on how to face common board challenges. The book is based upon the work of Mary C. Gentile who started the Giving Voice to Values (GVV) movement in 2009. The book is well-written and easy to follow, providing a good overview of the principles of the GVV framework and how it can be applied to help board members address ethical issues in their organizations. It also includes several case studies illustrating how the GVV framework has been used in practice. Overall, Giving Voice to Values in the Boardroom is a valuable resource for board members who want to ensure that their organizations operate ethically"
  }
]
