[
  {
    "title": "Special issue editorial - Interplay between commerical activities and well-being during the pandemic:  Studies from Asia",
    "type": "Special Issue editorial",
    "issue2" :true,
    "link": "journal-files/Editorial-Patch.pdf",
    "author": {
      "name": "",
      "name_raw": "",
      "info": [
        ""
      ]
    },
     "volume": "",
    "issue": "",
    "doiurl": "",
    "doidate": "",
    "abstract": "The COVID-19 pandemic proved to be a multidimensional phenomenon, affecting the medical, personal, business and societal fields. It has had a tremendous impact on a variety of aspects of our life including human interaction, business management and also the well-being of our individuals, society and the planet. Businesses, organizations and diverse institutions have played critical roles in the ongoing societal reaction to the pandemic. The papers selected – from Thailand, Philippines and India - illuminate how stakeholders, organizations and the broader macroenvironment interact in response to the new normal."
  
  },
    {
      "title": "Insights into consumer perceptions towards sustainability and well-being during COVID-19 pandemic",
      "type": "Research Paper",
      "issue2" :true,
      "link": "journal-files/JBES-sustainable-goods.pdf",
      "author": {
        "name": "Vanessa L. Chan, Vanessa L. Chan, Chloie Justine A. Favila, Kathleen Joyce L. Lao, Julianne Elise L. Lao, Angelique C. Blasa-Cheng, Patrick Adriel H. Aure",
        "name_raw": "Vanessa L. Chan",
        "info": [
          "De La Salle University, Phillipines"
        ]
      },
       "volume": "2",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/2-1I2022/1bmlm",
    "doidate": "April 2022",
      "abstract": "This study aims to examine the behaviour of urban and non-urban consumers towards sustainable household care products amid the COVID-19 pandemic. Qualitative interviews of 248 Filipino respondents was followed by a quantitative analysis in this mixed-methods research. The findings suggest that the value attitude towards sustainability and well-being efforts is positively significant for urban consumers’ sustainable behaviour—highlighting the consumer shift towards more well-being and sustainability-oriented predispositions. The study offers valuable empirical data in understanding the sustainable behaviour of urban and non-urban consumers towards household care products during a pandemic, providing a strong foundation in the decision-making of relevant stakeholders.",
      "keywords": [
       "Sustainable Consumer Behaviour", "Household Care", "COVID-19", "Filipino", "mixed methods" 
      ]
    },
    {
      "title": "Humanistic Management as a Driver of MSME Well-Being and Resilience during COVID-19: Multiple Case Study Research",
      "type": "Research Paper",
      "issue2" :true,
      "link": "journal-files/JBES ECGonzales.pdf",
      "author": {
        "name": "Erwin Carlo Gonzales",
        "name_raw": "Erwin Carlo Gonzales",
        "info": [
          "De La Salle University, University of the East"
        ]
      },
       "volume": "2",
    "issue": "2",
    "doiurl": "https://doi.org/10.61781/2-1I2022/2bmlm",
    "doidate": "April 2022",
      "abstract": "The Philippine economy is driven primarily by micro, small, and medium enterprises (MSMEs), which were devastated in the few years of the global pandemic. An exploratory inductive holistic multiple case study anchored on stakeholder theory and thematic analysis was used in order to understand the decisions and actions that entrepreneurs make during times of extraordinary crisis that is also an existential threat to the business. The results suggest that MSMEs that survived were those whose core values were rooted in the humanistic management paradigm that employees are ends in themselves, not merely instruments to mainstream business ends.",
      "keywords": [
        "COVID-19", "MSMEs", "Stakeholder theory", "humanistic management"
      ]
    },
    {
      "title": "Towards a cashless society in Thailand and the Philippines during the COVID-19 pandemic: Implications for improving financial and societal well-being",
      "type": "Research Paper",
      "issue2" :true,
      "link": "journal-files/JBES-cashless society.pdf",
      "author": {
        "name": "Joefrey Geroche",
        "name_raw": "Joefrey Geroche",
        "info": [
          "Faculty of Business Administration, Kasetsart University, Thailand",
          "fbusjrg@ku.ac.th"
        ]
      },
      "author2" : {
        "name" : "John Bertrand Gatchalian",
        "name_raw" : "John Bertrand Gatchalian",
        "info" : [
          "Local Government Unit, San Jose, Nueva Ecija, Philippines",
          "jbcgatchalian09@gmail.com"
        ]
      },
       "volume": "2",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/2-1I2022/3bmlm",
    "doidate": "April 2022",
      "abstract": "This study determines the e-satisfaction perception of cashless transactions by Filipinos in Thailand and the Philippines during the COVID-19 pandemic. The variables of interest include speed, ease, security and trust. Data was collected from a sample of 264 cashless transaction users using an adopted survey form. The study reveals that millennials and Gen Z are the two highest users of cashless transactions, while more women than men availed of these transactions. We recommend sustainable market segmentation and sustainable planning to uphold cashless transaction users' satisfaction levels. The Philippine and Thailand governments would do well to initiate cashless transaction literacy programmes, to enable improved financial and social well-being.",
      "keywords": [
        "cashless transactions", "cashless transaction factors", "Covid 19", "demographic variables", "e-satisfaction"
      ]
    },
    {
      "title": "Responsible Entrepreneurship: Altruism, Sacrifice, Solidarity and Innovation Among Select Philippine SMEs During COVID-19",
      "type": "Research Paper",
      "issue2" :true,
      "link": "journal-files/JBES-Responsible-Entrepreneurial-Jimenez.pdf",
      "author": {
        "name": "Shieradel Jimenez",
        "name_raw": "Shieradel Jimenez",
        "info": [
          "shieradel.jimenez@dlsu.edu.ph"
        ]
      },
      "author2": {
        "name": "Raymund Habaradas",
        "name_raw": "Raymund Habaradas",
        "info": [
          "De La Salle University, Philippines"
        ]
      },
      "author3": {
        "name": "Ian Benedict Mia",
        "name_raw": "Ian Benedict Mia",
        "info": [
          "Universitas Gadjah Mada, Indonesia"
        ]
      },
       "volume": "2",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/2-1I2022/4bmlm",
    "doidate": "April 2022",
      "abstract": "The pandemic has had a catastrophic effect on businesses worldwide. Many micro, small, and medium-sized enterprises (MSMEs) proved unable to cope with the detrimental business-related effects of the pandemic. In an endeavour to evaluate whether responsible entrepreneurship was being practiced even under these trying circumstances, we evaluated the data obtained from in-depth interviews, field notes, and published materials using the multiple research case study design. Our findings reveal that the selected Philippine MSMEs demonstrated responsible entrepreneurship through altruism, sacrifice, solidarity and innovation even under trying conditions, largely due to the zeal of the entrepreneur. Future areas for research are presented.",
      "keywords": [
        "COVID-19", "MSMEs", "Responsible Entrepreneurship"
      ]
    },
    {
      "title" : "A Study of Psychological Aspects of Food Delivery Personnel during Covid times",
      "type": "Research Paper",
      "issue2" :true,
      "link": "journal-files/A Study of Psychological Aspects of Food Delivery.pdf",
      "author": {
        "name": "Gautam Agrawal & Chandrima Roy",
        "name_raw": "Gautam Agrawal & Chandrima Roy",
        "info": [
          "Research Scholars, BML Munjal University, India",
          "gautam.18pd@bmu.edu.in"
        ]
      },
       "volume": "2",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/2-1I2022/5bmlm",
    "doidate": "April 2022",
      "abstract": "The Covid-19 induced lockdowns had severe effects on service industries and their employees. The researchers have primarily focused on the healthcare workers, their mental well-being and the evolving consumer behaviour in retail industry. Yet, the impact of the pandemic on the frontline retail employees especially those engaged in the food delivery is an under-researched area. In this qualitative study, the authors research the changed working conditions and the related occupational stress of the food delivery personnel from five major cities and towns in India. The findings have been categorised under three themes: perceived threat (source of anxiety and stress), self-protective behaviour (fear related) and perceived benefits (coping behaviour).",
      "keywords": [
        "Food delivery personnel", "pandemic", "Health Belief model", "stress", "fear", "coping behaviour"
      ]
    },
    {
      "title": "Sandra Waddock & Steve Waddell: Bounce Beyond Initiative",
      "type": "Practioner Perspective",
      "issue2" :true,
      "link": "journal-files/Interview-SWaddock and SWaddell-JBusEthSoc.pdf",
      "author": {
        "name": "Ju Young Lee",
        "name_raw": "Ju Young Lee",
        "info": [
          "Postdoctoral Associate, Ivey Business School, Western University, Canada"
        ]
      },
       "volume": "2",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/2-1I2022/6bmlm",
    "doidate": "April 2022",
      "abstract": "Bounce Beyond is a global community of people and initiatives working to co-create a shift in our economic paradigm and foster a movement towards ‘next’ economies that support the flourishing of all life—all people and nature. What follows is an interview with Sandra Waddock, Galligan Chair of Strategy at Boston College’s Carroll School of Management and steward of Bounce Beyond, and Steve Waddell, founder and co-lead steward of Bounce Beyond.",
      "keywords":[]
    },
     {
      "title": "Nonaka, Ikujiro and Takeuchi, Hirotaka. 2019. The Wise Company: How Companies Create Continuous Innovation. Oxford: Oxford University Press",
      "type": "Book Review",
      "link": "journal-files/Book-review-Wise-Company.pdf",
      "issue2" :true,
      "author": {
        "name": "Rocha, Raysa Geaquinto",
        "name_raw": "Rocha, Raysa Geaquinto",
        "info": [
          "PhD student, NECE Research Center in Business Sciences, University of Beira Interior"
        ]
      },
       "volume": "",
    "issue": "",
    "doiurl": "",
    "doidate": "",
      "abstract": "Practical wisdom (phronesis), as presented by Aristotle (ca. 350 B.C.E./2009), has been brought into management in recent decades and more recently into the knowledge management field. This construct consists of properly applying the moral and intellectual virtues to achieve appropriate and good results. However, the understanding of practical wisdom in management varies according to the authors and the purpose of its application."
    ,   "keywords":[]}, {
      "title": "Andrew J. Hoffman. The Engaged Scholar, 2021, Stanford University Press, Stanford",
      "type": "Book Review",
      "issue2" :true,
      "link": "journal-files/Book Review_The Engaged Scholar.pdf",
      "author": {
        "name": "Mary Lynn Lunn",
        "name_raw": "Mary Lynn Lunn",
        "info": [
          "Ph.D, Visiting Instructor, The University of Richmond, Robins School of Business."
        ]
      },
       "volume": "",
    "issue": "",
    "doiurl": "",
    "doidate": "",
      "abstract": "In his book The Engaged Scholar, Andrew Hoffman, the Holcim (US) Professor in the Ross School of Business and the School for Environment and Sustainability at the University of Michigan, proposes that we scholars selected our profession as university professors because we want to have a positive impact on the world.  Most universities have guiding principles outlining objectives for tenure track faculty to make contributions in research, teaching, and service throughout their careers.  Faculty service commonly consists of service to the university such as serving on university committees, community outreach through volunteering with local not-for-profit organizations, or publishing research in scholarly journals regarding community issues.  Professor Hoffman contends that, to truly make a positive impact on the world, scholars must stretch beyond these three objectives and engage in a wider range of public outreach activities."    
    }
  ]