[

    {
        "title": "Emotional Distress of Sri Lankan Women Returning to Work Post Maternity Leave",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/Emotional-Distress-of-Sri-Lankan-Women-Returning-to-Work.pdf",
        "author": {
            "name": "Lakshani Nayakaratne & Irosha Perera",
            "name_raw": "",
            "info": ["The Bristol Institute of Business Management, Sri Lanka"]
        },
         "volume": "4",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/4-2II2024/1bmlm",
      "doidate": "October 2024",
        "abstract": "Motherhood involves dramatic physical and emotional changes, and in today's context, women often balance corporate roles with traditional responsibilities. Returning to work post-maternity leave is especially challenging, requiring women to juggle work and family while adapting to motherhood. Despite this, factors contributing to emotional distress among working mothers in South Asia have received limited academic attention. This qualitative study interviewed eight first-time manager-mothers in Sri Lankan private sector businesses, via semi-structured interviews, using snowball sampling. Thematic analysis identified key stressors: lack of emotional and physical family support, well-intentioned but counterproductive familial assistance, unsupportive work environments, and societal backlash. A significant finding was that extended family support for childcare often led to emotional distress, with family members making mothers feel guilty and embarrassed. This study fills a gap in the literature by focusing on Sri Lanka and emphasizes the need to educate extended families on the childcare expectations of working mothers. ",
        "keywords": [
            "Emotional distress",
            " post-maternity leave",
            " managerial level working mothers",
            " family support",
            " work environment",
            " backlash from society",
            " Sri Lanka"
        ]
    },
    {
        "title": "Metaethics: A neuro-geometric proposal",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/Metaethics-A-Neuro-Geometric-Proposal.pdf",
        "author": {
            "name": "Bruce Hiebert",
            "name_raw": "",
            "info": ["Associate Professor, University Canada West, Canada"]
        },
         "volume": "4",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/4-2II2024/2bmlm",
      "doidate": "October 2024",
        "abstract": "Metaethics explores the relationship between types of ethics. The field of moral psychology has increasingly attempted to explain types of ethical thinking based on brain processes. This paper proposes a metaethical typology of seven distinct types of natural thinking processes rooted in how visual images are translated into abstract thinking. These seven ethical thinking types are Transcendent, Unitary, Hierarchical, Equitable, Vectoral, Analogic, and Topographical. Human beings then ladder concepts upon these processes using the construction of increasingly abstract metaphors. As proposed, these seven thinking processes appear to effectively form the foundation for current ethical theories such as Utilitarianism and Kantian Deontology, or other forms of moral reasoning. They may also be combined to explain the operations of more complex forms of moral reasoning such as religious ethics. Finally, they reveal that the possibility of natural thinking types has normative implications for ethics.",
        "keywords": [
            "Keywords: Ethics"," Metaethics"," Moral Psychology"," Neuropsychology"," Moral Reasoning"
        ]
    },
    {
        "title": "A Study on Financial Inclusion and Women Empowerment in Jammu District",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/A-Study-on-Financial-Inclusion-and-Women-Empowerment-in-jammu.pdf",
        "author": {
            "name": "Iram Javeed",
            "name_raw": "",
            "info": ["PhD Research Scholar, RIMT University, Punjab, India"]
        },
         "volume": "4",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/4-2II2024/3bmlm",
      "doidate": "October 2024",
        "abstract": "This research paper presents a study depicting the relationship between financial inclusion and women's empowerment in the Jammu district of India. This paper examines the barriers faced by women in accessing formal financial services and analyses the effectiveness of existing financial inclusion programmes in Jammu district. The findings reveal that various socio-economic and cultural factors contribute to the limited financial inclusion of the women. This paper ends by offering recommendations for policymakers, financial institutions and civil society organizations to enhance financial inclusion so as to promote women's empowerment in the Jammu district.",
        "keywords": []
    },
    {
        "title": "Mobile Payment Fintech Service Adoption and Security Concerns",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/Mobile-Payment-Fintech-Service-Adoption-And-Security-Concerns.pdf",
        "author": {
            "name": "Radhika Thapar & Saniya Marwah",
            "name_raw": "",
            "info": ["Rukmini Devi Institute of Advanced Studies, Affiliated to GGSIPU, India"]
        },
         "volume": "4",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/4-2II2024/4bmlm",
      "doidate": "October 2024",
        "abstract": "In India, the adoption of financial technology (Fintech) or financial technology innovation (FTI) has expanded due to the development of mobile devices and their use. The need for mobile Fintech payment systems that facilitate online and offline transactions has increased, especially during and after COVID times. However, mobile payment services are still used in limited areas due to concerns over the security of mobile applications for customers and Fintech companies alike. Drawing on the Technology Acceptance Model (TAM), the findings of this paper support the notion that usefulness, ease, user design, information security, and trust impact of mobile payment concerns and adoption factors in the Fintech environment are important variables. ",
        "keywords": [
            "Fintech"," security"," customer behaviour"," mobile payment"
        ]
    },
    {
        "title": "Measuring Perceptions of the Ethical Beliefs of Accountants and Non-Accountants",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/Measuring-Perceptions-of-the-Ethical-Beliefs-of.pdf",
        "author": {
            "name": "Clarence Goh",
            "name_raw": "",
            "info": ["Singapore Management University"]
        },
         "volume": "4",
      "issue": "2",
      "doiurl": "https://doi.org/10.61781/4-2II2024/5bmlm",
      "doidate": "October 2024",
        "abstract": "In this study, a survey was conducted with 210 participants recruited from Amazon Mechanical Turk to examine the perceptions that accountants and non-accountants have of (1) their own ethical beliefs and (2) the ethical beliefs of the typical accountant. The results indicate the following. Firstly, the ethical beliefs of accountants are weaker than those of non-accountants. Secondly, compared with non-accountants, accountants perceive that the typical accountant holds weaker ethical beliefs. Thirdly, while accountants perceive that they hold similar ethical beliefs as the typical accountant, non-accountants perceive that they hold stronger ethical beliefs than the typical accountant. Overall, the findings from this study provide insights for accounting practitioners to reflect on and evaluate the effectiveness of the activities that have been undertaken by the profession to strengthen the ethical beliefs of accountants and to improve the ethical reputation of accountants among internal and external stakeholders.",
        "keywords": [
            "Ethics, trust"," accountants' ethical beliefs "
        ]
    },
    {
        "title": "Free Will: Two neuroscientists disagree",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/Book-review-Free-Will-Two-Neuroscientists-Disagree.pdf",
        "author": {
            "name": "Bruce Hiebert",
            "name_raw": "",
            "info": [""]
        },
         "volume": "",
      "issue": "",
      "doiurl": "",
      "doidate": "",
        "abstract": null,
        "keywords": null
    },
    {
        "title": "Ethics for Beginners: Big Ideas from 32 Great Minds 2022, Peter Kreeft, United States Word on Fire",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/Book-review-Ethics-for-Beginners-Big-Ideas-from-32-Great-Minds.pdf",
        "author": {
            "name": "Jay Johns, Lecturer of Computer Science-Purdue University Fort Wayne",
            "name_raw": "",
            "info": [""]
        },
         "volume": "",
      "issue": "",
      "doiurl": "",
      "doidate": "",
        "abstract": null,
        "keywords": null
    },
    {
        "title": "Human resources for the non-HR manager by Carol T Kulik and Elissa L Perry",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/Book-review-Human-Resources-for-the-Non-HR-Manager.pdf",
        "author": {
            "name": "Richa Mishra",
            "name_raw": "",
            "info": [""]
        },
         "volume": "",
      "issue": "",
      "doiurl": "",
      "doidate": "",
        "abstract": null,
        "keywords": null
    }

]