[
  {
    "title": "JBES: A bridge journal with a unique identity",
    "type": "Editorial",
    "link": "journal-files/Editorial.pdf",
    "author": {
      "name": "Payal Kumar",
      "name_raw": "Payal Kumar",
      "info": [
        "Editor-in-Chief",
        "Professor & Chair HR/OB and Associate Dean, International Relations,",
        "BML Munjal University, India"
      ]
    },
    "abstract": "We are delighted to launch the Journal of Business, Ethics & Society (JBES) with this inaugural issue. JBES is an inter-disciplinary, peer-reviewed journal that publishes both theoretical and empirical research on a broad range of topics with regard to business management, business ethics and societal well-being. Broadly JBES focuses on the intersectionality of ethics and businesses, ethics and civil societies, and also on topics such as corporate social responsibility, social entrepreneurship and power dynamics."
  },
  {
    "title": "Natural Sustainability Ethics for Resolving Current Outer Space Challenges",
    "type": "Research Paper",
    "link": "journal-files/Ethics-Outer-Space.pdf",
    "author": {
      "name": "Oswald A.J. Mascarenhas S.J.",
      "name_raw": "Oswald A.J. Mascarenhas S.J.",
      "info": ["XLRI, Jamshedpur, Jharkhand, India"]
    },
    "abstract": "Currently, NASA and several outer space industry multi-billionaire entrepreneurs (e.g. Elon Musk (Space X), Jeff Bezos (Blue Origin), Richard Branson (Virgin Galactic)), are actively engaged in outer-space research that reports innovative advances such as, outer space: mining, tourism, medicine labs, terraforming Mars and the Moon, and altering celestial bodies and terrestrial humans to enhance extra-terrestrial survivability.  All these advances unearth serious ethical concerns of human identity and cosmic sustainability that we address here. Further, the current understanding of sustainability development (SD) is highly anthropocentric (i.e., the earth is meant solely for man’s use), and limited in scope as a terrestrial, temporal, economic and pro-human project. We expand SD to include trans-terrestrial, trans-temporal, trans-economic, and trans-human developments.  We view this complex problem by distinguishing anthropocentric (nature is for man) versus non-anthropocentric (man is for nature) modern views of natural sustainability; Each view can be made to include either natural outcomes / processes of nature, or industrial uses and outcomes of nature to provide a four-fold framework of Natural Sustainability within which we explore ethical implications of outer space advances (OSA). We discuss managerial implications and limitations and suggest directions for future research.",
    "keywords": [
      "Outer space industry",
      "Terraforming celestial bodies",
      "Natural Sustainability",
      "Cosmic Sustainability",
      "Transhumanism"
    ]
  },
  {
    "title": "Determinants of Employee Volunteer Intention: An Empirical Study on Functional Motivation Theory",
    "type": "Research Paper",
    "link": "journal-files/Employee-Volunteerism.pdf",
    "author": {
      "name": "Ericka Chua, Marika Chuateco, Leise Mangune, Jannine Shen, Patrick Adriel H. Aure",
      "name_raw": "Management and Organization Department, Ramon V. del Rosario College of Business, De La Salle University, Phillipines",
      "info": [
        "Management and Organization Department, Ramon V. del Rosario College of Business,",
        " De La Salle University, Phillipines"
      ]
    },
    "abstract": "Employee participation plays an important role in the success of corporate social responsibility programmes, but there are limited studies that understand the drivers of employee volunteerism in the Philippines.  Clary and Snyder’s functional motivation theory was drawn upon in determining the six kinds of volunteer motivations in this study conducted on employees from Pilipinas Shell Petroleum Corporation and SM Investment Corporation.  The respondents were divided by gender, age group, and volunteer experience to see whether these factors would significantly affect motivation; only volunteer experience emerged as significant in the findings. Another interesting finding is that employees are more inspired to volunteer when they can learn something new, and furthermore that women are more motivated by the social motive than men and are thus more likely to volunteer when their friends do so.",
    "keywords": [
      "Corporate Social Responsibility",
      "Volunteerism",
      "Employee Motives",
      "Volunteer Experience",
      "Gender"
    ]
  },
  {
    "title": "The power of Pause in enhancing ethical leadership",
    "type": "Research Paper",
    "link": "journal-files/PAUSE-INENHANCING.pdf",
    "author": {
      "name": "Mary Kay Chess, Magda Capellao Kaspary, Stacey Heiligenthaler, Patty Neil, Megan Ratcliffe & Petural ‘PJ’ Shelton",
      "name_raw": "Oswald A.J. Mascarenhas S.J.",
      "info": ["Saybrook University, USA"]
    },
    "abstract": "2020 was replete with complex leadership lessons. Multi-level societal experiences and ethical issues emerged with unprecedented speed. The global health pandemic known as COVID-19 was followed by the racial awakening – a response to the underlying pandemic of systemic racism. Amid this chaos, there was a weekly gathering throughout 2020 with the intention of creating a safe space for group reflection, dialogue, ethical inquiries and support. An opportunity for a PAUSE was created, informed in part by the work of Otto Scharmer. Leadership roles became an object of inquiry in congruence with their humanity. The method of convening, Circle, framed the support for the engagement and inquiry processes. This article describes how a group of professionals examined their leadership and sought to apply learnings while supporting one another – an adaptive leadership response that changed and strengthened their ethical leadership capacity.",
    "keywords": [
      "Circle, PAUSE",
      "Ethical Engagement",
      "Group Process",
      "Theory U",
      "Action Learning",
      "Systems Thinking",
      "Adaptive Leadership"
    ]
  },
  {
    "title": "Institutional Void to Institutional Work: Study of Digital Finance in India",
    "type": "Research Paper",
    "link": "journal-files/Institutional Void.pdf",
    "author": {
      "name": "Dr. Anirudh Agrawal, Dr. Kristjan Johannes Suse Jespersen, Dr. Keerti Pendyal",
      "name_raw": "Anirudh Agrawal, Kristjan Johannes Suse Jespersen, Keerti Pendyal",
      "info": [
        "Associate Professor, OP Jindal Global University, Delhi, India",
        "Associate Professor of Sustainable Innovation and Entrepreneurship, COPENHAGEN BUSINESS SCHOOL Department of Management, Society and Communication, Copenhagen, Denmark",
        "Assistant Professor of Economics, School of Management (Department of) Mahindra University, Hyderabad, Telangana, India"
      ]
    },
    "abstract": "This article presents a longitudinal development of digital finance in India. The article presents the growth of digital finance in India from the 1950s to 2022. It discusses various legislations, litigations and civil society activism in the initialization of digital finance in India. Consequently, this article studies the institutional development of digital finance in India using an institutional work framework. Further, it draws on institutional voids and institutional work framework to reflect the present state of digital finance and what must be done to ensure that it is more inclusive and protects its users' property rights. The article’s  works in the case of the institutionalisation of digital finance in India and its studies the development of digital finance in India using expert interviews and secondary data analysis.",
    "keywords": [
      "Digital finance literacy in India",
      "Digital finance",
      "Institutional work",
      "Financial ethics",
      "Financial institutions of India"
    ]
  },
  {
    "title": "Understanding The Male Mentality Of Menstruation Among University Students",
    "type": "Research Paper",
    "link": "journal-files/male mentality.pdf",
    "author": {
      "name": "Abhirup Saha, Priyam Shukla, Abin Dha, Nishant Shekhar, Rashi Maheshwari, Chirag Malik",
      "name_raw": "Abhirup Saha, Priyam Shukla, Abin Dha, Nishant Shekhar, Rashi Maheshwari, Chirag Malik",
      "info": [
        "MBA-BML Munjal University",
        "MBA-BML Munjal University",
        "MBA-BML Munjal University",
        "MBA-BML Munjal University",
        "Associate Professor and Assistant Dean BML Munjal University"
      ]
    },
    "abstract": "This research study aims to investigate the current perception and attitudes of young males towards menstruation in a developing nation, specifically India. The primary objective is to understand the existing mindset regarding menstruation and assess the potential for change and improvement in the attitudes of university students. Utilizing a quantitative research design, data were collected through a Google form and analysed using Excel and SPSS software. The findings indicate that educational qualification plays a significant role in shaping individuals' understanding and knowledge about menstruation. Furthermore, the study reveals that the stigma surrounding menstruation is more pronounced in rural and semi-rural areas. Importantly, the research highlights the influential role of female friends in enhancing male students' comprehension and awareness of menstruation and menstrual health. Promoting empathetic attitudes towards menstruation among male students is crucial for creating a supportive and inclusive environment for all individuals, irrespective of gender. These findings underscore the urgent need to address the prevailing taboos and misinformation surrounding menstruation, in order to improve overall well- being and reduce stigma in society.",
    "keywords": [
      "Menstruation",
      "University",
      "Social Stigma",
      "Rural",
      "Social Embarrassment"
    ]
  },
  {
    "title": "Tae Wan Kim: Artificial Intelligence in the workplace, through an ethical lens",
    "type": "Practioner Perspective",
    "link": "journal-files/Interview-AI-in-workplace.pdf",
    "author": {
      "name": "Elva A. Resendez, PhD",
      "name_raw": "Elva A. Resendez, PhD"
    },
    "abstract": [
      "Artificial intelligence today continues to assimilate into our modern service industry occupations such as business, economics and health care.  It is predicted that AI will continue to develop exponentially as a business staple and will follow a similar path to The Internet and Social Media in terms of growth opportunities and also the criticality to business.  The concern for many, including Dr. Tae Wan Kim, associate professor of ethics at Carnegie Mellon University, is how the ethics of AI will affect individuals and society. In his recent book review, Machines Like Me, Kim writes on the varied ethical systems potentially used in AI training as he discusses the character development of the text.  Whether a deontological approach or a consequentialist approach, AI is only as good as the training and the data provided.  In this interview he says that to really address ethics issues in AI, much more funding should be given to moral philosophy and applied ethics."
    ]
  },
  {
    "title": "Christian U. Becker, Business Ethics: Methods and Application. ",
    "type": "Book Review",
    "link": "journal-files/Book-review-of-Christian-Becker-by-Aguiling.pdf",
    "author": {
      "name": "Maria Adiel H. Aguiling ",
      "name_raw": "Maria Adiel H. Aguiling "
    }
  },
  {
    "title": "Oswald A. J. Mascarenhas, Corporate Ethics for Turbulent. Markets (vols 1 & 2)",
    "type": "Book Review",
    "link": "journal-files/Book-review-Corporate-Ethics-for-Turbulent-Markets.pdf",
    "author": {
      "name": "Anabel Benjamin Bara"
    }
  },
  {
    "title": "Bernard Mees. The rise of business ethics.",
    "type": "Book Review",
    "link": "journal-files/Book-review-rise-business-ethics.pdf",
    "author": {
      "name": "Retchell L, Morales"
    }
  }

]
