[
  {
    "title": "Dors D’Souze, E. Abraham, Oswald A. J. Mascarenhas. J R D Tata: Orations on Business Ethics. 2019. 440 pp.",
    "type": "Book Review",
    "issue2" :true,
    "link": "journal-files/Review Harcup What's the point of news D Baines.pdf",
    "author": {
      "name": "Dr David Baines",
      "name_raw": "Dr David Baines",
      "info": [
        "Newcastle University, UK"
      ]
    },
    "abstract": "Not surprisingly, much of the news media around the world has been passing through tough times. Challenges such as collapsing business models, collapses in their perceived credibility and trustworthiness, and consistent attack from governments intolerant of criticism – or any level of scrutiny continue. Some of those governments are autocratic, but others are supposedly liberal democracies where news is traditionally regarded as an essential element in the democratic process.   Thus, now presents a timely moment to pose the question Tony Harcup presents us with: What’s the point of News? At the heart of this inquiry is an interrogation of what we understand by “news”. On the face of it, the answer is obvious – it is what we see and hear and read on TVs and radios, on our screens and on the pages of newspapers. But Harcup has spent many years teasing apart the processes that put that stuff together, shape it, structure it, define it – what is selected to be news, what is rejected – and why. And today, he says, there are question marks over news when it comes to access, autonomy, trust, and democracy. These questions apply as much to ethics as to economics."
  },
  
   {
    "title": "The Power of And. Responsible Business Without Trade-Offs. R. Edward Freeman, Kirsten E. Martin, and Bidhan L. Parmar. Columbia Business School ",
    "type": "Book Review",
    "link": "journal-files/The Power of And_Noblin Tollive.pdf",
    "issue2" :true,
    "author": {
      "name": "Ashlee Noblin",
      "name_raw": "Ashlee Noblin",
      "info": [
        "Doctoral candidate, The University of Texas at Tyler, USA"
      ]
    },
    "abstract": "Throughout management history, the topic of ethics, corporate responsibility, their relation to business, and what the true purpose of a business should focus on to be deemed successful, have evolved and been consistently challenged. The challenge escalated in the 1970’s with Milton Friedman’s declaration of a business’s sole responsibility to increase profits. Friedman went so far as to call businessmen who touted social responsibility as “puppets” used to undermine the free market (Friedman, 1970). The argument is exacerbated by the difficulty of implementing social responsibility (Deer & Zarestky, 2017)"
  }, {
    "title": "The conscientious manager. SAGE Publications - P. Medicharla (2021)",
    "type": "Book Review",
    "issue2" :true,
    "link": "journal-files/Book Review_A Blauvelt.pdf",
    "author": {
      "name": "Alex Blauvelt",
      "name_raw": "Alex Blauvelt",
      "info": [
        "MBA student, Purdue University, USA"
      ]
    },
    "abstract": "Conscientiousness, according to the literature, is often tied to employee performance and workplace autonomy (Simmering, Colquitt, Noe, & Porter, 2003). Little research exists on understanding conscientiousness as an inward reflective exercise. The book bridges this gap by helping managers understand its role on the individual manager and the organization.  Empirical research by Lin, Lin, Ma, Wang and Wang (2015) suggests that conscientiousness is the reason why individuals intentionally allocate personal resources such as time, physical, mental, and emotional energies, or financial resources when it pertains to work performance.  Additionally, conscientiousness assists individuals resist the negative effects of stress. More practically, conscientiousness can both promote and exacerbate stressors in work performance.  Thus, knowing how to individually manage an individual’s conscientiousness to promote individual and organizational success is a positive outcome for any reader.  "
  }
]