[
    {
      "title": "Managing for the Common Good:  Catholic Social Teachings and Ethical Management Practice",
      "type": "Research Paper",
      "issue2" :true,
      "link": "journal-files/Managing-for-the-Common-Good.pdf",
      "author": {
        "name": "Mary Margaret Que and Benito Teehankee",
        "name_raw": "Mary Margaret Que and Benito Teehankee",
        "info": [
          "De La Salle University, Phillipines"
        ]
      },
      "abstract": "The Philippines is a predominantly Catholic country but business managers who explicitly integrate their faith within their business practice is relatively rare. This has contributed to Catholics living what has been referred to as a divided life. Using Alford and Naughton’s model of explicit engagement through case study research on the Filipino practicing Catholic and entrepreneur, Bernido Liu and his company Golden ABC, this paper provides an understanding of how Catholic Social Teaching (CST) can be integrated with ethical management practice, especially with respect to traditionally difficult management decisions. This study can increase the awareness of entrepreneurs and managers about an alternative way of doing business, namely doing well in business while also doing good by using CST as a guide when making decisions.",
      "keywords": [
        "Catholic Social Teaching",
        "Workplace Spirituality",
        "Integrating Faith and Work",
        "Decision Making"
      ]
    },
    {
      "title": "The impact of ethical leadership and stakeholder orientation on employee CSR participation: A conceptual study",
      "type": "Research Paper",
      "issue2" :true,
      "link": "journal-files/Joy of Giving.pdf",
      "author": {
        "name": "Annu Mathew and Rohit Punnoose",
        "name_raw": "Annu Mathew and Rohit Punnoose",
        "info": [
          "Doctoral scholars, XLRI, India"
        ]
      },
      "abstract": "Corporate social responsibility programmes have become the norm today, with most large companies creating separate teams and making significant investments specifically for this purpose. Companies can strategize, allocate funds, and make detailed plans, but it would all be fruitless if employees - one of the critical stakeholders - did not contribute to these activities. After all, the onus of CSR does not lie solely on the leadership, rather employees need to be equally invested in becoming part of the organizational culture. The objective of this study is to devise a framework showing the drivers of employee participation in CSR activities, drawing on the three constructs of ethical leadership, stakeholder orientation, and employee identification.",
      "keywords": [
        "Employee CSR Participation", 
        "Organizational Identification",
         "Ethical Leadership",
          "Stakeholder Orientation", 
          "Social Responsibility"
      ]
    },
    {
      "title": "Nancy Bocken: Transition businesses to a circular service business model",
      "type": "Practioner Perspective",
      "issue2" :true,
      "link": "journal-files/Interview with N.Bocken.pdf",
      "author": {
        "name": "Adiel H. Aguiling",
        "name_raw": "Adiel H. Aguiling,",
        "info": [
          "Doctoral candidate, De La Salle University, Philippines"
        ]
      },
      "abstract": "Corporations are tasked to take responsibility for the consequences of their actions on the people, society, and environment. Although the exhortation has been on the radar for three decades, pernicious business practices ensue.  To address the problem, sustainability champions seek innovations. One of these innovations is the circular economy. Dr. Nancy Bocken, Professor of Sustainable Business at the Maastricht Sustainability Institute (MSI), is a leading scholar in the field. She has embarked on a project on circular economy innovation and counsels professionals and legislators on the conversion of businesses to a circular service business model.  In this interview, Dr. Bocken explains the four key strategies of a circular economy, how these strategies link to the ethical aspect of doing business, and concomitantly how these strategies lead to profitability. On one hand, she provides examples of unsustainable business models. On the other hand, she explains the creation of sustainable value at the different stages of a business and at different levels in the organization. Dr. Bocken conveys that for circular economy and circular service business models to succeed, collaboration is imperative"  },
    {
      "title": "Mary Gentile: Giving Voice to Values: Enabling People to Act Ethically",
      "type": "Practioner Perspective",
      "issue2" :true,
      "link": "journal-files/Mary-Gentile-interview.pdf",
      "author": {
        "name": "Shieradel V. Jimenez",
        "name_raw": "Shieradel V. Jimenez",
        "info": [
          "Assistant professor, De La Salle University, Phillipines"
        ]
      },
      "abstract": "Business schools have been teaching business ethics in one form or another for decades, yet the continuation of corporate scandals seems to point to the futility of these efforts. The question as to whether business schools can truly mould the ethical inclination of students remains paramount. Many educators who believe that schools can affect change in this area have called for a rethinking of how business ethics is taught. A pedagogy and a curriculum that focuses on developing people's capacities to act on their ethical values effectively in any setting, Giving Voice to Values provides a different approach to the ethical analysis methodology traditionally employed in business ethics classrooms."
    }
  ]