[
    {
        "title": "Beyond the GDP: Advancing Towards Inclusive Wealth Framework",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/1Beyond.pdf",
        "author": {
            "name": "Soumya Bhowmick",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-1I2025/1bmlm",
        "doidate": "April 2025",
        "abstract": "In 2015, the United Nations replaced the Millennium Development Goals (MDGs) with 17 Sustainable Development Goals(SDGs), heralding a more comprehensive approach to sustainable development.This transition highlights significant Global North - South disparities and the limitations of traditional progress metrics such as Gross Domestic Product(GDP).The Inclusive Wealth Framework, integrating natural, human, and produced capital, offers a holistic alternative to GDP by assessing national prosperity through sustainability and intergenerational equity.This paper explores how the Inclusive Wealth Framework can enhance progress metrics and better align with national sustainability objectives, focusing on its relevance for countries like India, and addresses key challenges such as methodological inconsistencies, data quality, and valuation techniques.The findings suggest that incorporating the Inclusive Wealth Framework into the SDGs can provide nuanced insights into sustainable development and support more effective policymaking.Despite its potential, the framework faces several challenges, including the need for improved data quality, refined valuation methods, and further research into the role of private capital flows in promoting inclusive wealth.This study advocates adopting the Inclusive Wealth Framework to provide a more comprehensive understanding of progress toward sustainable development.",
        "keywords": [
            "Sustainable Development Goals (SDGs)",
            "Gross Domestic Product (GDP)",
            "produced capital",
            "natural capital",
            "human capital"
        ]
    },
    {
        "title": "Decoding the Labour Landscape: An In-Depth Exploration of India's Labour Market Trends and Dynamics (2017-2023) ",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/2Decoding.pdf",
        "author": {
            "name": "Nitish Kumar Minz and Deepika Chaudhary",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-1I2025/2bmlm",
        "doidate": "April 2025",
        "abstract": "This study examines Bhakti marga, the devotional path in Hinduism characterized by deep immersion and complete submission to the divine. The research focuses on the Prema-margi branch of Bhakti, which emphasizes love-based devotion to deities with form, contrasting with the knowledge-based Gyan-margi tradition. This paper demonstrates how Bhakti traditions foster community engagement, compassion and emotional transformation through participatory devotional activities that transcend social boundaries. This has significant implications for management practices through service-oriented leadership models and emotional intelligence frameworks derived from various bhavas. The tradition's emphasis on ego dissolution, selfless service and authentic devotion provides valuable insights for an ethical living at both the individual and leadership levels.",
        "keywords": [
            "Labour market",
            "labour force participation rate (LFPR)",
            "worker population ratio (WPR)",
            "unemployment rate (UR)",
            "gender analysis",
            "employment trends",
            "policy implications",
            "India",
            "sustainability",
            "crisis resilience",
            "macroscopic view "
        ]
    },
    {
        "title": "Remote Work and AI in Workplace Communication: Pros, Cons and Ethical Considerations ",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/3Remote.pdf",
        "author": {
            "name": "Ayishat Sandra Olanrewaju",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-1I2025/3bmlm ",
        "doidate": "April 2025",
        "abstract": "Workplace communication has evolved over the years due to several factors, including remote work and artificial intelligence. Therefore, organizations need to know how to harness the opportunities arising out of these changes and reduce the negative impacts. This paper examines the role of remote work and artificial intelligence in workplace communication. The paper is anchored on the human relations theory of management and systems theory. Using desk research method, this paper examines a few advantages, disadvantages and ethical considerations in remote work in relation to workplace communication. In addition, it examines some benefits, drawbacks, and ethical considerations in artificial intelligence in relation to workplace communication. Some recommendations include the need for organizations to continually train and retrain their employees, invest in the right digital tools and develop remote communication policies.",
        "keywords": [
            "Artificial intelligence",
            "human communication",
            "organizational communication",
            "workplace communication"
        ]
    },
    {
        "title": "CSR and Inclusivity: A Case for Dalit Upliftment through CSR",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/4CSR.pdf",
        "author": {
            "name": "Aabha Netam",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-1I2025/4bmlm",
        "doidate": "April 2025",
        "abstract": "This paper investigates the invisibility of Dalits in corporate India, arguing that their exclusion from diversity policies, underrepresentation in corporate hierarchies, and systemic discrimination are deliberate outcomes of caste-blind practices within the corporate sector. It contends that this caste-blindness is extended to existing CSR policies, which often generalize poverty alleviation efforts, and so fail to account for the unique socio-economic challenges faced by Dalits. This paper centres on addressing Dalit invisibility, purporting that it is essential for companies to create CSR initiatives that drive genuine and sustainable change for the community, thereby aligning corporate actions with the true spirit of social responsibility.",
        "keywords": [
            "Dalit",
            "corporate social responsibility",
            "social exclusion",
            "inclusivity"
        ]
    },
    {
        "title": "Entrepreneurs’ Propensity for Corruption: A Theoretical Framework",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/5Entrepreneurs.pdf",
        "author": {
            "name": "Jyro B. Triviño",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-1I2025/5bmlm",
        "doidate": "April 2025",
        "abstract": "This conceptual paper develops an integrative theoretical framework to understand entrepreneurs' propensity for corruption through the lens of rational choice theory. While entrepreneurship is often celebrated for contributing to economic development and innovation, the dark side of entrepreneurial behaviour, particularly corruption, remains understudied. The author proposes a comprehensive model that explains how entrepreneurs evaluate and engage in corrupt practices. It is argued that entrepreneurs' decisions to engage in corruption are influenced by rational calculations of costs and benefits and the interplay between internalized norms and deliberative decision-making processes. This paper contributes to organizational theory by bridging the gap between rational choice and normative approaches to ethical decision-making while offering practical insights for anti-corruption efforts in entrepreneurial contexts. ",
        "keywords": [
            "Entrepreneurship",
            "corruption",
            "ethical decision-making",
            "rational choice theory",
            "norm internalization",
            "behavioural ethics"
        ]
    },
    {
        "title": "Waiting for Shiva: Unearthing the Truth of Kashi’s Gyan Vapi. By Vikram Sampath (Ink Occam, 2024) ",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/BKR.pdf",
        "author": {
            "name": "Sukrit Banerjee",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "",
        "issue": "",
        "doiurl": "",
        "doidate": "",
        "abstract": null,
        "keywords": null
    },
    {
        "title": "Deconstructing Moral Responsibility: Book Review Essay",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/BKR-2.pdf",
        "author": {
            "name": "Bruce Hiebert",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "",
        "issue": "",
        "doiurl": "",
        "doidate": "",
        "abstract": null,
        "keywords": null
    }
]