[
    {
        "title": "Unveiling Sustainability's Shadows Through PESTEL Analysis",
        "type": "Editorial-5 Year celebration of JBES",
        "issue2": true,
        "link": "journal-files/1MALIK-v5i1.pdf",
        "author": {
            "name": "D M Arvind Mallik",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-2II2025/1bmlm",
        "doidate": "October 2025",
        "abstract": "This study employs the PESTEL framework to critically examine the dark side of sustainability, focusing on systemic paradoxes and negative externalities in sustainability initiatives. Using a qualitative approach, it synthesizes secondary data from case studies and literature reviews in technology, construction, and agriculture to assess sustainability complexities. The analysis reveals that political incoherence, economic disparities, social resistance, rapid technological shifts, environmental trade-offs, and fragmented legal frameworks create unintended consequences, limiting the effectiveness of sustainability efforts. By offering the first comprehensive PESTEL-based analysis of sustainability paradoxes, this research underscores the necessity of structured risk identification to enhance decision-making and refine sustainable development strategies. It emphasizes the social implications for corporations, policymakers, and academia, advocating for community-driven initiatives, adaptive legal frameworks, and international collaboration to address inequities, particularly between developed and developing nations, in transitioning to low-carbon economies.",
        "keywords": [
            "Sustainability",
            "Dark side",
            "PESTEL framework",
            "Negative outcomes",
            "Impacts and evaluation",
            "Implications",
            "Conceptual framework"
        ]
    },
    {
        "title": "Infusing Workplace Spirituality and Ethics with Bhakti Marg",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/2AGARWAL-v5i1.pdf",
        "author": {
            "name": "Aditya Agrawal",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-2II2025/2bmlm",
        "doidate": "October 2025",
        "abstract": "This study examines Bhakti marga, the devotional path in Hinduism characterized by deep immersion and complete submission to the divine. The research focuses on the Prema-margi branch of Bhakti, which emphasizes love-based devotion to deities with form, contrasting with the knowledge-based Gyan-margi tradition. This paper demonstrates how Bhakti traditions foster community engagement, compassion and emotional transformation through participatory devotional activities that transcend social boundaries. This has significant implications for management practices through service-oriented leadership models and emotional intelligence frameworks derived from various bhavas. The tradition's emphasis on ego dissolution, selfless service and authentic devotion provides valuable insights for an ethical living at both the individual and leadership levels.",
        "keywords": [
            "Spirituality in the workplace",
            "Bhava",
            "Types of Bhakti",
            "Ethics",
            "Compassion",
            "Inclusive workplace",
            "Emotions"
        ]
    },
    {
        "title": "Community-Embedded Entrepreneurship as a Force for Good:  Insights from Philippine Case Studies ",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/3ROBES-v5i1.pdf",
        "author": {
            "name": "John Laurence A. Robes and Patrick Adriel H. Aure",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-2II2025/3bmlm",
        "doidate": "October 2025",
        "abstract": "Entrepreneurs increasingly recognize that being a force for good requires genuine partnership with marginalized communities, creating opportunities to challenge conventional business and development thinking. Through analysis of four award-winning Philippine social enterprises, this study examines how these partnerships generate economic, social, environmental, and cultural value simultaneously. The enterprises studied demonstrate strategic hybridity, dynamically navigating between traditional practices and market demands rather than choosing one over the other. Resource constraints and cultural assets, typically viewed as limitations, become sources of innovation unavailable to mainstream businesses. These community-embedded enterprises achieve what we term embedded autonomy —gaining market flexibility precisely through deepening community ties rather than loosening them. The findings suggest that business as a force for good requires recognizing and supporting diverse organizational forms emerging from the margins, not imposing standardized models. This has implications for development practice, funding approaches, and how we theorize entrepreneurship itself.",
        "keywords": [
            "Community-embedded entrepreneurship",
            "Social enterprise",
            "Indigenous innovation",
            "Strategic hybridity",
            "Business as a force for good",
            "Philippines"
        ]
    },
    {
        "title": "Economic and Political Factors Affecting Local Firm Productivity Among Philippine Cities ",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/4CASTRO-v5i1.pdf",
        "author": {
            "name": "Kenneth Michael A. De Castro",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-2II2025/4bmlm",
        "doidate": "October 2025",
        "abstract": "While firm productivity is largely driven by economic factors such as availability of labor, capital, resources, and markets, local governments play a crucial role in enhancing productivity within their respective jurisdictions. Their influence extends across various sectors and functions, making them indispensable to economic development. However, limited studies were done in the context of developing economies, including the Philippines; hence, this study offers the novelty of being one of the few to examine the effect of selected economic and political factors on local firm productivity among cities in the Philippines. Using a panel data covering five years from 2019 to 2023, among the economic factors, the size of the local economy and the level of financial deepening significantly affect local firm productivity, while among the political factors, the city’s degree of autonomy significantly affects local firm productivity. This study aims to help local government units create and implement crucial economic and governance policies as an enabling mechanism for sustainable economic development.",
        "keywords": [
            "Government efficiency",
            "firm productivity",
            "governance",
            "local government units",
            "public policy"
        ]
    },
    {
        "title": "Microfinance and Mission Drift: Navigating the Ethical Tensions Between Financial Self-Sufficiency and Poverty Alleviation",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/5BIRADAR-v5i1.pdf",
        "author": {
            "name": "Basamma Biradar and Lisa Deas",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "5",
        "issue": "1",
        "doiurl": "https://doi.org/10.61781/5-2II2025/5bmlm",
        "doidate": "October 2025",
        "abstract": "Indian Microfinance Institutions (MFIs) have historically worked towards generating social benefits through activities aimed at poverty reduction and financial inclusion, while maintaining financial stability. However, growing commercialisation and structural transformation within the sector can lead to mission drift, the gradual departure of an organisation from its founding social objectives. Through comparative case studies of SKS Microfinance, CreditAccess Grameen Ltd, Bandhan Bank and SEWA, this paper examines how institutional transitions, from NGOs to NBFCs or universal banks, impact client targeting, lending practices, and governance priorities. Findings suggest that organisational structure plays a key role in either safeguarding or undermining mission integrity. This study highlights the tension between financial sustainability and poverty outreach, offering insights for policymakers, social investors, and MFI leaders on how to preserve social purpose while scaling operations in competitive markets.",
        "keywords": [
            null
        ]
    },
    {
        "title": "Thriving in Disruption: Agile Organizations, Collective Leadership and New Work by Neha Chatwani, Indus Source Books (2025)",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/BKR-BHATT-v5i1-br1.pdf",
        "author": {
            "name": "Pooja Bhatt",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "",
        "issue": "",
        "doiurl": "",
        "doidate": "",
        "abstract": null,
        "keywords": null
    },
    {
        "title": "The Fearless Diversity, Equity and Inclusion Practitioner by Roman Ruzbacky, Fiona Krautil, Tom Verghese, Synergistic Press (2024) ",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/BKR-LUNDY-v5i1-br2.pdf",
        "author": {
            "name": "Dr. Judy Lundy",
            "name_raw": "",
            "info": [
                ""
            ]
        },
        "volume": "",
        "issue": "",
        "doiurl": "",
        "doidate": "",
        "abstract": null,
        "keywords": null
    }
]