[
  {
    "title": "Taking Business Ethics Seriously- Why Ethics Is an Essential Tool for the Modern Workplace by John Hooker, Productivity Press",
    "type": "Book Review",
    "issue2": true,
    "link": "journal-files/Book Review-Taking Ethics Seriously.pdf",
    "author": {
      "name": "Dr Elva A Resendez, Clinical Assistant Professor in Management",
      "name_raw": "Dr Elva A Resendez, Clinical Assistant Professor in Management",
      "info": [
        "Doermer School of Business at Purdue University Fort Wayne Indiana &amp; Danny House, Quality Engineer, senior member of the American Society for Quality (ASQ)",
        ""
      ]
    }
  },
  {
    "title": "The Art of Meaningful Universal Values: Case Study Analysis",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Universal Values-May.pdf",
    "author": {
      "name": "May Tungtakanpoung & Maria Postoyeva",
      "name_raw": "May Tungtakanpoung & Maria Postoyeva",
      "info": [
        "London South Bank Business School, England",
        "Westminster Business School, England"
      ]
    },
       "volume": "3",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/3-1I2023/1bmlm",
    "doidate": "April 2023",
    "abstract": "This article explores the relationship between individual and organizational values in order to create a positive performance outcome. Meaningful organizational cultures based on intrinsic values have been found to increase staff engagement and create a happy workforce, which in turn leads to improved customer service and loyalty. Yet, organizations struggle to develop such cultures. The study of organizational and individual values in the airline industry is particularly under-theorised and under investigated. So, the case studies of Thai Airways and South West Airlines were used to illustrate how organizational culture can be enhanced by recognising and incorporating real and intrinsic values. This paper contributes to knowledge as it shows how a more meaningful culture can be developed by incorporating individuals’ spiritual beliefs into organizational values. It further contributes by exploring how such meaningful organizational cultures can make organizations more resilient and adaptable in unpredictable and demanding environments.",
    "keywords": [
      "organizational culture, strategy, values, universal value-based model, work environment."
    ]
  },
  {
    "title": "Faculty development initiatives critical to navigate multicultural Business Schools",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Faculty Development-Sivakumar-pk.pdf",
    "author": {
      "name": "Soumya Sivakumar & Carly Speranza",
      "name_raw": "Soumya Sivakumar & Carly Speranza",
      "info": [
        "Marymount University, USA (ssivakum@marymount.edu)",
        "Marymount University, USA"
      ]
    },
       "volume": "3",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/3-1I2023/2bmlm",
    "doidate": "April 2023",
    "abstract": "Due to the increasing complexity of higher educational institutions and the rising mobility of students from new nations and cultures entering higher education, business school environments and their faculty are experiencing greater challenges in providing an inclusive learning experience across multiple classrooms and instructional formats. Business schools need to rise to the occasion to develop their faculty to meet these new challenges, rather than the onus being on faculty alone. This paper reviews the literature and ends with recommendations for business school administrators and management to help foster a business school culture of diversity, inclusion, and acceptance for faculty, staff, and students.",
    "keywords": [
      "Internationalization, ethical responsibility, business school, faculty development, AACSB, inclusive"
    ]
  },
  {
    "title": "Analyzing The Intention-Behaviour Gap on the use of Recycling Delivery Packaging",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Recycling-Ang.pdf",
    "author": {
      "name": "Stephanie Dianne Ang, Jenevieve Kimberly Chua, Franz Jerico Espineli, Kairin Nicole Yu & Patrick Adriel H Aure",
      "name_raw": "Stephanie Dianne Ang, Jenevieve Kimberly Chua, Franz Jerico Espineli, Kairin Nicole Yu & Patrick Adriel H Aure",
      "info": ["De La Salle University, Philippines"]
    },
       "volume": "3",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/3-1I2023/3bmlm",
    "doidate": "April 2023",
    "abstract": "Drawing on the Theory of Planned Behaviour (TPB) and the Norm Activation Model (NAM), this study examines the gap between consumer intention and behaviour, in the context of product delivery packaging recyclability, through the factors that affect it. Using a mixed-method, sequential-explanatory approach, survey data was analyzed through Jamovi, while insights from the interviews were derived via thematic analysis. This study found that awareness of consequences is a factor that affects personal norms. Additionally, personal norms mediate the relationship between awareness of consequences and recycling intention. Furthermore, perceived behavioural control significantly affects how intention influences behaviour. This research can contribute to creating evidence-based recycling initiatives and solutions for the government and e-commerce to stimulate consumer recycling behaviour and alleviate the environmental impact of post-product delivery packaging waste.",
    "keywords": [
      "Theory of Planned Behaviour, Norm Activation Model, recycling intention, recycling behaviour, product delivery packaging"
    ]
  },
  {
    "title": "Organizational Resilience of Filipino Music Performers during the COVID-19 Pandemic: A Dynamic Capabilities View",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Music-Jimenez-PB New.pdf",
    "author": {
      "name": "Maria Monica Therese Hernaez, Joshua Martin Magallanes, Hans Erickson Tan, Shieradel V. Jimenez, Emmanuel Fernando Jimenez & Angelique Blasa-Cheng",
      "name_raw": "Maria Monica Therese Hernaez, Joshua Martin Magallanes, Hans Erickson Tan, Shieradel V. Jimenez & Emmanuel Fernando Jimenez",
      "info": ["De La Salle University, Philippines"]
    },
       "volume": "3",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/3-1I2023/4bmlm",
    "doidate": "April 2023",
    "abstract": "This study looks into the dynamic capabilities theory and its relationship with organizational resilience by drawing on a sample of select Filipino live music performers, specifically rock bands. A qualitative thematic analysis approach was used to answer the research questions with the help of transcribed interviews and online data. The pandemic gave rise to several obstacles. To overcome these challenges, the bands exhibited dynamic capabilities. Key themes in each of the capacities of the dynamic capabilities framework were seen, for example, Digital Transformation and Vicarious Learning under Sense, and Changing the Songwriting Process and Evolving Future Outlook under Transform. This study can help business organizations, artists, and workers in the live music industry cope with fast-changing environments and crises. This research can also serve to understand dynamic capabilities in more detail.",
    "keywords": [
      "Philippines, live music performers, dynamic capabilities, organizational resilience"
    ]
  },
  {
    "title": "Understanding the Concept of Doubled Suffering in Capitalist-Oriented Organizations",
    "type": "Research Paper",
    "issue2": true,
    "link": "journal-files/Suffering-Angela Chen-Final.pdf",
    "author": {
      "name": "Angela P. Chen, Australia (angela.chen@unimelb.edu.au)",
      "name_raw": "Angela P. Chen, Australia (angela.chen@unimelb.edu.au)",
      "info": ["University of Melbourne"]
    },
       "volume": "3",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/3-1I2023/5bmlm",
    "doidate": "April 2023",
    "abstract": "In compassion literature, suffering is typically described as an undeniable reality in organizational life. While compassion literature has described the assessing sub-process as informing whether an individual will respond compassionately or not, there are fewer insights regarding the relationship between a non-response and suffering. This study seeks to understand the suffering experience from the employee’s perspective by interviewing 26 managers and non-managers from various industries. The results indicate that when individuals perceive their suffering as being ignored, this exacerbates their suffering. The preliminary finding suggests that continuing business-as-usual and doing nothing in the face of an employee’s suffering can “double” their suffering.",
    "keywords": [
      "compassion, organizations, leaders, doubled suffering, capitalism"
    ]
  },
  {
    "title": "Chris Brewster: How does, or can, human resource management contribute to business, ethics and society?",
    "type": "Practioner Perspective",
    "issue2": true,
    "link": "journal-files/Interview-HRM-Chris Brewster.pdf",
    "author": {
      "name": "Dr Chris Brewster",
      "name_raw": "Dr Chris Brewster",
      "info": ["Interviewer: Khayar Al Ansi, Henley Business School, UK"]
    },
       "volume": "3",
    "issue": "1",
    "doiurl": "https://doi.org/10.61781/3-1I2023/6bmlm",
    "doidate": "April 2023",
    "abstract": "Dr Chris Brewster is Professor of International Human Resource Management at Henley Business School in the UK. He is a prolific and highly cited author, with over 30 books, and 250 research articles. He was a practitioner for the first half of his working life and has been a scholar studying international and comparative human resource management for the second half. On the basis of that experience, he has increasingly argued for a more ethical, less elitist and more encompassing approach to human resource management. He recognizes that the economy is changing continuously with technological developments and argues that, although there are no easy answers, our thinking needs to encompass the long-term effects of technological change on human work."
  ,"keywords":[]
  }
]
