[

    {
        "title": "Digital Technology Adoption Among Philippine Micro-, Small-,and Medium-Sized Enterprises: Barriers, Enablers & Challenges During COVID-19",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/Digital_Technology.pdf",
        "author": {
            "name": "",
            "name_raw": "",
            "info": ["Ian Benedict Mia, Shieradel Jimenez, Raymund Habaradas, Jessica Jaye Ranieses, Cholo Javier and Jelica Enriquez"]
        },
        "abstract": "The COVID-19 pandemic has forced Philippine micro-, small-, and medium-scale enterprises (MSMEs) to undergo some form of digitalization to survive and continue servicing clients' needs. Many MSMEs failed to cope with the business-related impacts of the pandemic — 70.6% of which decided to shut down temporarily (Shinozaki, 2020). Others were able to transition with the help of digital technologies, allowing them to withstand the pandemic's impacts. These businesses started adopting social media and e-commerce platforms and meeting with clients via virtual setups, to name a few. For this research, we identified the enablers, barriers, and challenges faced by select Philippine MSMEs as they attempted to enhance their digital capabilities. Using the multiple case study research design, we examined the narratives derived from our in-depth interviews with 9 Philippine-based MSMEs. Our findings show that Philippine MSMEs experienced diverse enablers, barriers, and challenges during COVID-19 and exhibited increased openness to digital technologies. Finally, we present that MSMEs that can effectively address their barriers and challenges are likely to come out stronger in the postpandemic era. Given this, post-pandemic resilience is necessary for MSMEs to sustain business operations, withstand future shocks, and capitalize on new business opportunities.",
        "keywords": [
            "Digital technology adoption",
            "Enablers",
            "Barriers",
            "Challenges",
            "MSMES",
            "Philippines",
            "Covid-19"
        ]
    },
    {
        "title": "A Stakeholder Analysis of Manila’s Kolek Kilo Kita Waste Management Program",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/A_Stakeholder_Analysis.pdf",
        "author": {
            "name": "",
            "name_raw": "",
            "info": ["Adrian A. Mabalay, Angelique C. Blasa-Cheng, Maricel S. Balatbat, Franz Corneille K. Li, Jose Gabriel G. Cortel and Ashley Jade C. De Silva"]
        },
        "abstract": "Despite the Philippines ranking among the top contributors to plastic waste, little emphasis is given to the recycling programs of manufacturing companies in the country. The purpose of this paper is to determine the expected roles of stakeholders and the values that are exchanged in the Kolek Kilo Kita para sa Walastik na Maynila program by using a combination of role theory and stakeholder theory. The researchers believe there is a need to emphasize the importance of permeable role boundaries to ensure stability in a recycling program to combat the increase of plastic waste in our oceans and landfills. As this study uses a qualitative method, specifically an embedded single-case study design, the researchers interviewed at least one representative from each stakeholder entity involved—Unilever Philippines, Manila City government, Republic Cement, and the project participants. The researchers found a general alignment of expected and actual roles among the stakeholders, though participants displayed a limited understanding of Republic Cement’s role in processing the collected plastics. The analysis also revealed stakeholders are satisfied and motivated to continue engagement in the program due to perceived value exchanges—Unilever Philippines achieves corporate sustainability aims, the city government fulfills obligations to citizens, Republic Cement secures materials for manufacturing, and residents gain free products. ",
        "keywords": [
            "Reverse logistics",
            "role theory",
            "recycling initiatives",
            "stakeholder theory",
            "values exchange",
            "waste management"
        ]
    },
    {
        "title": "Ageism: The New Menace for the IT Workforce in India & How to Tackle It",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/Ageism_The_New.pdf",
        "author": {
            "name": "",
            "name_raw": "",
            "info": ["Rati Hegde and Abhishek Kumar"]
        },
        "abstract": "This paper delves into the phenomenon of ageism, characterized by the manifestation of adverse attitudes and behaviours directed towards oneself or others based on age. The repercussions of ageism include stereotypes and discriminatory conduct within interpersonal relationships. The primary aim of this conceptual paper is to explore ageism within the Information Technology (IT) sector in India and propose strategies to mitigate its detrimental effects. Despite the pervasive existence of ageism in the Indian IT industry, disproportionately affecting older employees, it can serve as a catalyst for fostering a culture of continual upskilling and reskilling among this demographic. Policies focused at promoting active ageing by using an inclusive approach towards intergenerational contact among all age groups can help reduce the negative impacts of ageism.",
        "keywords": [
            "Ageism",
            "IT industry",
            "ageism in workplace",
            "active ageing",
            "intergenerational contact"
        ]
    },
    {
        "title": "Comprehensive Literature Review of Customer Experience Paradigms",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/Comprehensive_Literature.pdf",
        "author": {
            "name": "",
            "name_raw": "",
            "info": ["Jyro B. Triviño"]
        },
        "abstract": "This paper aims to explore customer experience extensively within the existing literature. Commencing with a critical examination of the current landscape and the controversies it encapsulates, the paper will focus on diverse definitions of customer experience and its constituent elements such as touchpoints, individual context, and discrete emotions. Subsequently, an evaluative review of the arguments employed to measure customer experience will be presented, emphasizing their differentiation from crucial marketing metrics. Lastly, the paper will culminate in a synthesis that addresses the primary research lacunae in this field. We benefit from a more detailed exploration of how these differing perspectives impact the practical application of customer experience strategies in marketing or business contexts. This further enhances the understanding of why reaching a consensus on its definition remains challenging and why various interpretations persist.",
        "keywords": [
            "Customer experience",
            "touchpoints",
            "individual context",
            "discrete emotions",
            "marketing"
        ]
    },
    {
        "title": "Pakikipagpalagayang- loob: Exploring Mutual Trust between Programme Managers and Children in a Philippine Residential Care Facility",
        "type": "Research Paper",
        "issue2": true,
        "link": "journal-files/Pakikipagpalagayang.pdf",
        "author": {
            "name": "",
            "name_raw": "",
            "info": ["Maria Adiel H. Aguiling"]
        },
        "abstract": "This study examines the trust relationship between the programme managers and residents in a house for girls in need of protection in the Philippines which advocates child participation. The research employs interviews with the programme managers and residents (10) using Sikolohiyang Pilipino (Filipino psychology) methods of pagtatanong-tanong (asking questions) and pakikipagkuwentuhan (exchanging stories). The first research question explores how the management demonstrates trust towards the children, revealing cognitive and affective trust, along with the manifestation of palagay ang loob, ease within the inner selves of both parties. The second question unveils reciprocal trust, where the initial trust of the managers is mirrored by the children in their benevolence, ability, and integrity. Notably, the study introduces the concept of pakikipagpalagayang-loob, highlighting mutual trust rooted in the acceptance and understanding of holistic selves. The study contributes to local literature by addressing a research gap in understanding residential care within the Philippine context. Moreover, it enhances the body of knowledge on Filipino Psychology by analyzing trust through the lenses of loob and kapwa in Sikolohiyang Pilipino.",
        "keywords": [
            "Trust",
            "Sikolohiyang Pilipino",
            "faith-based NGO",
            "children in need of special protection",
            "beneficiary participation."
        ]
    },
    {
        "title": "A Review of Subhashish Bhadra’s Caged Tiger: How Too Much Government Is Holding Indians Back (Bloomsbury 2023, 272 pages)",
        "type": "Book Review",
        "issue2": true,
        "link": "journal-files/bookreview.pdf",
        "author": {
            "name": "",
            "name_raw": "",
            "info": ["Sreejit Datta"]
        },
        "abstract": null,
        "keywords": null
    }
]